#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```terraform

data.terraform_remote_state.rds: Reading...
data.aws_iam_role.name: Reading...
data.aws_vpcs.selected: Reading...
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
data.aws_subnets.selected: Reading...
data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
data.aws_subnet.selected["subnet-068ba086fa9ec5f3c"]: Reading...
data.aws_subnet.selected["subnet-0d9cde3667aaefbb1"]: Reading...
data.aws_subnet.selected["subnet-00b7f11ca75a8cd81"]: Reading...
data.aws_subnet.selected["subnet-073cd9360da18e0fa"]: Reading...
data.aws_subnet.selected["subnet-0100fc516eba5c443"]: Reading...
data.aws_subnet.selected["subnet-0883948b9be5124a2"]: Reading...
data.aws_subnet.selected["subnet-0d9cde3667aaefbb1"]: Read complete after 0s [id=subnet-0d9cde3667aaefbb1]
data.aws_subnet.selected["subnet-068ba086fa9ec5f3c"]: Read complete after 0s [id=subnet-068ba086fa9ec5f3c]
data.aws_subnet.selected["subnet-0883948b9be5124a2"]: Read complete after 0s [id=subnet-0883948b9be5124a2]
data.aws_subnet.selected["subnet-00b7f11ca75a8cd81"]: Read complete after 0s [id=subnet-00b7f11ca75a8cd81]
data.aws_subnet.selected["subnet-073cd9360da18e0fa"]: Read complete after 0s [id=subnet-073cd9360da18e0fa]
data.aws_subnet.selected["subnet-0100fc516eba5c443"]: Read complete after 0s [id=subnet-0100fc516eba5c443]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_security_group.eks-sg will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "eks-sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # aws_eks_addon.aws_ebs_csi_driver will be created
  + resource "aws_eks_addon" "aws_ebs_csi_driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.28.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "NONE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.core_dns will be created
  + resource "aws_eks_addon" "core_dns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.1-eksbuild.4"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.29.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.16.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_cluster.eks-techlanches will be created
  + resource "aws_eks_cluster" "eks-techlanches" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-techlanches"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::590183830079:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.29"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.100.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-00b7f11ca75a8cd81",
              + "subnet-0100fc516eba5c443",
              + "subnet-068ba086fa9ec5f3c",
              + "subnet-073cd9360da18e0fa",
              + "subnet-0883948b9be5124a2",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techlanches-node will be created
  + resource "aws_eks_node_group" "techlanches-node" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks-techlanches"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "c3.xlarge",
        ]
      + node_group_name        = "techlanches-node"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::590183830079:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00b7f11ca75a8cd81",
          + "subnet-0100fc516eba5c443",
          + "subnet-068ba086fa9ec5f3c",
          + "subnet-073cd9360da18e0fa",
          + "subnet-0883948b9be5124a2",
        ]
      + tags_all               = (known after apply)
      + version                = "1.29"

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }
    }

  # aws_security_group.eks-sg will be created
  + resource "aws_security_group" "eks-sg" {
      + arn                    = (known after apply)
      + description            = "Default security group for the EKS cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-default-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @gabriellima09, Action: `pull_request`*